In [1]:
# requirement

import pandas as pd
import numpy as np
import datetime as dt

In [9]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url,sep='|',index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [37]:

def age_buckets(x): 
    if x < 30: 
        return '18-29' 
    elif x < 40: 
        return '30-39' 
    elif x < 50: 
        return '40-49' 
    elif x < 60: 
        return '50-59' 
    elif x < 70: 
        return '60-69' 
    elif x >=70: 
        return '70+' 
    else: 
        return 'other'

In [40]:
users['age_gp'] = users.age.apply(age_buckets)

users.groupby('age_gp').describe()

          age
        count       mean       std   min   25%   50%    75%   max
age_gp
18-29   409.0  23.168704  4.078687   7.0  20.0  24.0  27.00  29.0
30-39   241.0  33.962656  2.951457  30.0  31.0  34.0  36.00  39.0
40-49   168.0  44.517857  2.958745  40.0  42.0  44.0  47.00  49.0
50-59    94.0  53.074468  2.732675  50.0  51.0  53.0  55.00  59.0
60-69    27.0  62.925926  3.037280  60.0  60.0  62.0  65.00  69.0
70+       4.0  70.750000  1.500000  70.0  70.0  70.0  70.75  73.0

In [41]:
users.groupby('occupation').age.describe()

               count       mean        std   min    25%   50%    75%   max
occupation
administrator   79.0  38.746835  11.123397  21.0  30.00  37.0  48.00  70.0
artist          28.0  31.392857   8.668116  19.0  25.00  30.0  39.00  48.0
doctor           7.0  43.571429  12.501428  28.0  35.50  45.0  48.50  64.0
educator        95.0  42.010526  10.413264  23.0  33.00  42.0  50.00  63.0
engineer        67.0  36.388060  11.199236  22.0  28.00  36.0  43.00  70.0
entertainment   18.0  29.222222  10.056052  15.0  23.00  25.0  33.00  50.0
executive       32.0  38.718750  10.608075  22.0  31.00  38.5  46.00  69.0
healthcare      16.0  41.562500  11.313524  22.0  30.50  44.5  49.25  62.0
homemaker        7.0  32.571429  10.737119  20.0  24.50  32.0  38.50  50.0
lawyer          12.0  36.750000  10.830303  21.0  28.75  34.0  47.75  53.0
librarian       51.0  40.000000  11.023611  23.0  30.00  39.0  49.00  69.0
marketing       26.0  37.615385   9.474500  24.0  30.25  36.0  42.50  55.0
none             9.0  26.555556  13.757826  11.0  16.00  26.0  33.00  55.0
other          105.0  34.523810  10.738227  13.0  26.00  32.0  44.00  64.0
programmer      66.0  33.121212   9.624512  20.0  27.00  30.0  38.00  63.0
retired         14.0  63.071429   5.757461  51.0  60.00  63.0  67.25  73.0
salesman        12.0  35.666667  14.079859  18.0  28.25  34.0  38.25  66.0
scientist       31.0  35.548387   7.392964  23.0  30.00  37.0  40.00  55.0
student        196.0  22.081633   5.284081   7.0  19.00  21.0  25.00  42.0
technician      27.0  33.148148   9.867210  21.0  24.00  30.0  40.00  55.0
writer          45.0  36.311111  11.423306  18.0  26.00  36.0  48.00  60.0

In [59]:
users.head(934)

         age gender  occupation zip_code age_gp
user_id
1         24      M  technician    85711  18-29
2         53      F       other    94043  50-59
3         23      M      writer    32067  18-29
4         24      M  technician    43537  18-29
5         33      F       other    15213  30-39
...      ...    ...         ...      ...    ...
930       28      F   scientist    07310  18-29
931       60      M    educator    33556  60-69
932       58      M    educator    06437  50-59
933       28      M     student    48105  18-29
934       61      M    engineer    22902  60-69

[934 rows x 5 columns]

In [8]:
dti = pd.to_datetime(['1/1/2018', np.datetime64('2018-01-01'),dt.datetime(2018, 1, 1)])
dti

DatetimeIndex(['2018-01-01', '2018-01-01', '2018-01-01'], dtype='datetime64[ns]', freq=None)

In [16]:
dti = pd.date_range('2018-01-01', periods=5, freq='H')
dti

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00', '2018-01-01 03:00:00',
               '2018-01-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [17]:
dti = dti.tz_localize('UTC')
dti

DatetimeIndex(['2018-01-01 00:00:00+00:00', '2018-01-01 01:00:00+00:00',
               '2018-01-01 02:00:00+00:00', '2018-01-01 03:00:00+00:00',
               '2018-01-01 04:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='H')

In [18]:
dti.tz_convert('US/Pacific')
dti

DatetimeIndex(['2018-01-01 00:00:00+00:00', '2018-01-01 01:00:00+00:00',
               '2018-01-01 02:00:00+00:00', '2018-01-01 03:00:00+00:00',
               '2018-01-01 04:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='H')